# DSO106 L3 Hands On Updated Taraneh

## Import Packages

In [25]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report, confusion_matrix

## Load in Data

In [26]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## Data Wrangling

### Drop the string columns

In [27]:
x = titanic.drop('class', axis=1)
y = titanic['class']

### Drop Missing Values

In [28]:
titanic.dropna(inplace=True)

In [29]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [30]:
titanic.sex.unique()

array(['female', 'male'], dtype=object)

In [31]:
titanic['sex'] = titanic['sex'].replace(['male', 'female'], [0,1])

In [32]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,1,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,1,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,0,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,1,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,1,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [33]:
titanic = pd.get_dummies(titanic)

In [49]:
x = titanic.drop("survived", axis=1)
y = titanic["survived"]

In [50]:
x_train, x_test, y_train, y_test = train_test_split(x,y, test_size=0.3)

In [51]:
decisionTree = DecisionTreeClassifier(random_state=76)
decisionTree.fit(x_train, y_train)

DecisionTreeClassifier(random_state=76)

In [52]:
treePredictions = decisionTree.predict(x_test)

In [53]:
print(confusion_matrix(y_test, treePredictions))

[[14  0]
 [ 0 41]]

In [54]:
print(classification_report(y_test, treePredictions))

              precision    recall  f1-score   support

           0       1.00      1.00      1.00        14
           1       1.00      1.00      1.00        41

    accuracy                           1.00        55
   macro avg       1.00      1.00      1.00        55
weighted avg       1.00      1.00      1.00        55

In [55]:
forest = RandomForestClassifier(n_estimators=500, random_state=76)
forest.fit(x_train, y_train)

RandomForestClassifier(n_estimators=500, random_state=76)

In [56]:
forestPredictions = forest.predict(x_test)
print(confusion_matrix(y_test, forestPredictions))
print(classification_report(y_test, forestPredictions))

[[14  0]
 [ 0 41]]
              precision    recall  f1-score   support

           0       1.00      1.00      1.00        14
           1       1.00      1.00      1.00        41

    accuracy                           1.00        55
   macro avg       1.00      1.00      1.00        55
weighted avg       1.00      1.00      1.00        55